In [1]:
import pandas as pd

# Importing specific columns from CSV file

In [66]:
df = pd.read_csv("cars.csv")

In [5]:
df.head()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450

In [6]:
df.tail()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
200,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,23,28,16845
201,-1,95,volvo,gas,sedan,rwd,front,68.8,55.5,ohc,141,160,19,25,19045
202,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohcv,173,134,18,23,21485
203,-1,95,volvo,diesel,sedan,rwd,front,68.9,55.5,ohc,145,106,26,27,22470
204,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,19,25,22625

In [7]:
df.shape

(205, 15)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null object
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(2), int64(5), object(8)
memory usage: 24.1+ KB

In [10]:
df.describe()

,symboling,width,height,engine-size,city-mpg,highway-mpg,price
count,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000
mean,0.834146,65.907805,53.724878,126.907317,25.219512,30.751220,13227.478049
std,1.245307,2.145204,2.443522,41.642693,6.542142,6.886443,7902.651615
min,-2.000000,60.300000,47.800000,61.000000,13.000000,16.000000,5118.000000
25%,0.000000,64.100000,52.000000,97.000000,19.000000,25.000000,7788.000000
50%,1.000000,65.500000,54.100000,120.000000,24.000000,30.000000,10345.000000
75%,2.000000,66.900000,55.500000,141.000000,30.000000,34.000000,16500.000000
max,3.000000,72.300000,59.800000,326.000000,49.000000,54.000000,45400.000000

In [11]:
# Average price of the cars
df['price'].mean()

13227.478048780487

In [21]:
# Which car is the costlier ?
df[df['price'] == df['price'].max()]['make']

74    mercedes-benz
Name: make, dtype: object

In [27]:
# another way
df['price'].idxmax()

74

In [28]:

df.iloc[df['price'].idxmax()]['make']

'mercedes-benz'

In [37]:
# Which car has lowest city-mileage 
# Which engine-type has highway-mileage
# Which body-style car is the cheapest

In [38]:
# Which car has lowest city-mileage 
df[df['city-mpg'] == df['city-mpg'].min()]['make']

49    jaguar
Name: make, dtype: object

In [42]:
# Which engine-type has highway-mileage
df[df['highway-mpg'] == df['highway-mpg'].max()]['engine-type']
# df.iloc[df['highway-mpg'].idxmax()]['engine-type']

30    ohc
Name: engine-type, dtype: object

In [39]:
# Which body-style car is the cheapest
# df[df['price'] == df['price'].min()]['body-style']
df.iloc[df['price'].idxmin()]['body-style']

'hatchback'

In [ ]:
# Categorical columns

In [ ]:
# 1.What are the different fuel-types. which one used the most ?
# 2. Which body-style cars are very less
# 3. How many engine-types and which is less used

In [ ]:
# 1.What are the different fuel-types. which one used the most ?
# df['fuel-type'].unique()
df['fuel-type'].value_counts()

In [53]:
# 2. Which body-style cars are very less
df['body-style'].value_counts().tail(1)

convertible    6
Name: body-style, dtype: int64

In [54]:
# 3. How many engine-types and which is less used
df['engine-type'].value_counts().tail(1)

dohcv    1
Name: engine-type, dtype: int64

## Groupby

In [5]:
mydict = {"name":["Jack","Jill","Jack","Jill"],"subject":["ML","ML","PY","PY"],"marks":[80,90,96,84]}

In [6]:
df = pd.DataFrame(mydict)

NameError: name 'pd' is not defined

In [3]:
df

NameError: name 'df' is not defined

In [59]:
df.groupby("name").groups

{'Jack': Int64Index([0, 2], dtype='int64'),
 'Jill': Int64Index([1, 3], dtype='int64')}

In [60]:
df.groupby("subject").groups

{'ML': Int64Index([0, 1], dtype='int64'),
 'PY': Int64Index([2, 3], dtype='int64')}

In [61]:
# USE : To group by categories and perform aggregate functions (sum,max,min,mean,std)

In [63]:
df.groupby("name")["marks"].sum()

name
Jack    176
Jill    174
Name: marks, dtype: int64

In [64]:
df.groupby("name")["marks"].mean()

name
Jack    88
Jill    87
Name: marks, dtype: int64

In [65]:
df.groupby("subject")["marks"].sum()

subject
ML    170
PY    180
Name: marks, dtype: int64

In [67]:
# What is the average city mileage for each manufacturer ?
df.groupby("make")["city-mpg"].mean()

make
alfa-romero      20.333333
audi             18.857143
bmw              19.375000
chevrolet        41.000000
dodge            28.000000
honda            30.384615
isuzu            31.000000
jaguar           14.333333
mazda            25.705882
mercedes-benz    18.500000
mercury          19.000000
mitsubishi       24.923077
nissan           27.000000
peugot           22.454545
plymouth         28.142857
porsche          17.400000
renault          23.000000
saab             20.333333
subaru           26.333333
toyota           27.500000
volkswagen       28.583333
volvo            21.181818
Name: city-mpg, dtype: float64

In [ ]:
# What is the average price for each body-style of cars ?
# What is the average highway-mpg for each engine-style ?
# What is the average price for each make of the car ?

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null object
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(2), int64(5), object(8)
memory usage: 24.1+ KB

In [70]:
# What is the average price for each body-style of cars ?
df.groupby("body-style")["price"].mean()

body-style
convertible    21890.500000
hardtop        22208.500000
hatchback      10015.800000
sedan          14502.260417
wagon          12371.960000
Name: price, dtype: float64

In [72]:
# What is the average highway-mpg for each engine-style ?
df.groupby("engine-type")["highway-mpg"].mean()

engine-type
dohc     24.833333
dohcv    28.000000
l        28.833333
ohc      32.567568
ohcf     29.600000
ohcv     21.230769
rotor    23.000000
Name: highway-mpg, dtype: float64

In [77]:
# What is the average price for each make of the car ?
# sorting
df.groupby("make")["price"].mean().sort_values(ascending=False)

make
jaguar           34600.000000
mercedes-benz    33647.000000
porsche          27520.400000
bmw              26118.750000
volvo            18063.181818
audi             17022.142857
mercury          16503.000000
alfa-romero      15498.333333
peugot           15489.090909
saab             15223.333333
isuzu            12708.250000
mazda            10652.882353
nissan           10415.666667
volkswagen       10077.500000
toyota            9885.812500
renault           9595.000000
mitsubishi        9239.769231
subaru            8541.250000
honda             8184.692308
plymouth          7963.428571
dodge             7875.444444
chevrolet         6007.000000
Name: price, dtype: float64

In [80]:
# Which make has the highest average price ?
# df.groupby("make")["price"].mean().max()    # hihest price
df.groupby("make")["price"].mean().idxmax()

34600.0

In [81]:
# Which body-style has minimum average city-mpg ?
df.groupby("body-style")["city-mpg"].mean().idxmin()

'convertible'

In [82]:
# Which engine-type has lowest highway-mpg ?
df.groupby("engine-type")["highway-mpg"].mean().idxmin()

'ohcv'

In [83]:
# Multiple category group

In [84]:
df.groupby(["body-style","fuel-type"])["price"].mean()

body-style   fuel-type
convertible  gas          21890.500000
hardtop      diesel       28176.000000
             gas          21356.000000
hatchback    diesel        7788.000000
             gas          10048.086957
sedan        diesel       14774.400000
             gas          14451.864198
wagon        diesel       19727.666667
             gas          11368.909091
Name: price, dtype: float64

In [48]:
newdict = {"name":["john","jack","jill"],"math":[40,50,60],"science":[45,55,65]}

In [49]:
df = pd.DataFrame(newdict)

In [50]:
df

   name  math  science
0  john    40       45
1  jack    50       55
2  jill    60       65

In [51]:
## How to add new rows and columns to dataframe

In [52]:
# adding column
df["total marks"] = df["math"] + df["science"]

In [53]:
df

   name  math  science  total marks
0  john    40       45           85
1  jack    50       55          105
2  jill    60       65          125

In [54]:
# another way adding column
grade = pd.Series(["B","B","A"],name="grade")
df = pd.concat([df,grade], axis=1,)

In [55]:
df

   name  math  science  total marks grade
0  john    40       45           85     B
1  jack    50       55          105     B
2  jill    60       65          125     A

In [56]:
# Add series as a row to dataframe
row = pd.Series(["James",70,50,120,"B"], index=["name","math","science","total marks","grade"])

In [57]:
row

name           James
math              70
science           50
total marks      120
grade              B
dtype: object

In [58]:
df = df.append(row,ignore_index=True)

In [59]:
df

    name  math  science  total marks grade
0   john    40       45           85     B
1   jack    50       55          105     B
2   jill    60       65          125     A
3  James    70       50          120     B

## Merge

In [35]:
players1 = {"players":["bkumar","hardik","ashwin","bumrah"],"wickets":[120,100,98,150]}
players2 = {"players":["sehwag","hardik","ashwin","sachin"],"runs":[8000,6000,5500,9500]}

In [36]:
batsman = pd.DataFrame(players2)
bowler = pd.DataFrame(players1)

In [37]:
batsman

  players  runs
0  sehwag  8000
1  hardik  6000
2  ashwin  5500
3  sachin  9500

In [38]:
bowler

  players  wickets
0  bkumar      120
1  hardik      100
2  ashwin       98
3  bumrah      150

In [40]:
# inner merge bydefault(how=inner)
pd.merge(batsman,bowler,on='players')

  players  runs  wickets
0  hardik  6000      100
1  ashwin  5500       98

In [41]:
# outer merge
pd.merge(batsman,bowler,on='players',how="outer")

  players    runs  wickets
0  sehwag  8000.0      NaN
1  hardik  6000.0    100.0
2  ashwin  5500.0     98.0
3  sachin  9500.0      NaN
4  bkumar     NaN    120.0
5  bumrah     NaN    150.0

In [42]:
# right merge
pd.merge(batsman,bowler, on='players', how='right')

  players    runs  wickets
0  hardik  6000.0      100
1  ashwin  5500.0       98
2  bkumar     NaN      120
3  bumrah     NaN      150

In [44]:
# left merge
pd.merge(batsman,bowler, on="players", how="left")

  players  runs  wickets
0  sehwag  8000      NaN
1  hardik  6000    100.0
2  ashwin  5500     98.0
3  sachin  9500      NaN